use vk;

INSERT INTO `users` (`id`, `firstname`, `lastname`, `email`, `phone`) 
VALUES ('25', 'Иван', 'Иванов', 'qwe1@gmail.com', '967454545');

INSERT INTO `users` (`id`, `firstname`, `lastname`, `email`, `phone`) 
VALUES ('29', 'Петр', 'Пустота', 'qwe2@gmail.com', '967454546');

INSERT INTO users VALUES
('30', 'Семен', 'Семенов', 'example1@example.org', 01),
('31', 'Петр', 'Петров', 'arlo516@example.org', 02),
('32', 'Соловей', 'Соловьев', 'arlo517@example.org', 03),
('33', 'Иван', 'Бургачов', 'arlo518@example.org', 04),
('104', 'Неправильный', 'Пользователь', 'wronguser@example.org', 123456789) -- пользователь, которого мы удалим
;

insert into users (id, firstname, lastname, email, phone) values
('220', 'Геральт', 'Сапковский', 'geralt@example.org', '937456323116'),
('226', 'Рагнар', 'Лоброк', 'ragnar@example.org', '937456323117'),
('232', 'Томми', 'Версетти', 'tommy@example.org', '937456323118'),
('250', 'Гендальф', 'Серый', 'grey@example.net', '937456323119'),
('348', 'Дмитрий', 'Бамберг', 'schokk@example.net', '937456323111')
;

delete from users
where id = 104;

INSERT INTO messages values
('1','220','226','С днем рождения','1995-08-28 22:44:29'),
('2','25','29','Привет',now()),
('3','232','250','Привет','1993-09-14 19:45:58'),
('4','250','232','Привет','1985-11-25 16:56:25'),
('5','348','33','Привет','1999-09-19 04:35:46')
;

truncate table messages; -- удалим всю таблицу сообщений

INSERT INTO messages values -- заполним по новой
('1','220','226','С днем рождения','1995-08-28 22:44:29'),
('2','25','29','Привет',now()),
('3','232','250','Привет','1993-09-14 19:45:58'),
('4','250','232','Привет','1985-11-25 16:56:25'),
('5','348','33','Привет','1999-09-19 04:35:46')
;

INSERT INTO friend_requests values
	('226', '220', 'requested','1993-09-14 19:45:58', '1999-09-19 04:35:46'),
	('232', '226', 'declined','1993-09-14 19:45:58', '1999-09-19 04:35:46'),
	('33', '348', 'requested','1993-09-14 19:45:58', '1999-09-19 04:35:46'),
	('250', '232', 'requested','1993-09-14 19:45:58', '1999-09-19 04:35:46')
;

UPDATE friend_requests -- модифицируем один из запросов
SET 
	status = 'declined',
	confirmed_at = '2001-11-25 16:56:25'
WHERE
	initiator_user_id = 33 and target_user_id = 348
	;

-- вернем данные о пользователе по id или фамилии
SELECT *
FROM users
WHERE id IN (348);

SELECT *
FROM users
WHERE lastname = 'Лоброк';


INSERT INTO posts values
('1','220','Мой блог','1995-08-28 22:44:29'),
('2','29','Привет, это мой новый блог',now()),
('3','250','Привет','1993-09-14 19:45:58'),
('4','232','Привет','1985-11-25 16:56:25'),
('5','33','Привет','1999-09-19 04:35:46')
;









